Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Конечные классы: при ручном разбиении по границе в мастере настройки для непрерывных полей, если был отключен параметр «Включить верхние границы интервала» и в контекстом меню на области класса выбирался вариант «Разбить по границе», то границы определялись некорректно и у предыдущего класса совпадали верхние и нижние границы (#8695).
en: Coarse сlasses: in case of the manual bound binning in the continuous fields wizard, if "Include upper bin bounds" parameter was disabled and "Bound split" option was selected in the context menu in the class area, the bounds were incorrectly defined and upper and lower bounds of the previous class coincided (#8695).

source: Кросс-таблица: Добавлена проверка на переполнение для количества результирующих колонок.
en: Cross table: Overflow checking was added for the number of resulting columns.

source: Куб: при изменении набора измерений пропадало отображение на диаграмме служебных или вычисляемых фактов, после удаления и повторного добавления таких фактов, они вновь отображались на диаграмме (#8195).
en: Cube: when changing dimensions set, the chart display of service or calculated measures (#8195) was lost, when such measures were deleted and repeatedly added, they were displayed in the chart again.

source: Куб: если в измерении переменного типа находились данные разних типов (одновременно строки и числа), то не сохранялись настроенные в диаграмме Куба цвета серий (графиков) (#8123).
en: Cube: if different data types (both strings and numbers) were in the variable dimension, the series (images) colors set in the Cube chart were not saved (#8123).

source: Куб: если в строках Куба имелись вложенные поля, а в столбцах вложенности не было, то, если в таком Кубе развернуть все строки, а после этого сохранить и закрыть пакет, через некоторое время возникала ошибка «Не удалось закрыть пакет.
en: Cube: if there were nested fields in the Cube rows, and there was no nesting in the columns, if all rows were expanded in such Cube and then the package was saved and closed, the following error occurred: "Failed to close package.

source: Куб: если после импорта из Deductor Warehouse или LGD-файла, в котором для полей были заданы назначения по умолчанию Группа, создавался визуализатор Куб и для полей с назначением по умолчанию Группа были настроены отображаемые факты, а затем добавлен вычисляемый факт на основе выбранных ранее для отображения фактов, после чего, скрывались факты, используемые при расчете вычисляемых фактов, то после сохранения и повторного открытия пакета вычисляемые факты не рассчитывались (#5803).
en: Cube: if after import from Deductor Warehouse or LGD file in which Group default usage types were set for fields, the Cube visualizer was created, and the displayed measures were configured for the fields with Group default usage types. Then, the calculated measure based on the measures selected earlier for display was added. Afterwards, the measures used for calculation of the calcualted measures were concealed, and after package saving and repeated opening, the calculated measures were not calculated (#5803).

source: Линейная регрессия: добавлен вывод ошибки при обучении «Линейной регрессии», когда количество входов превышает количество строк.
en: Linear regression: The message is currently shown when training the "Linear regression" when the count of inputs exceeds the count of rows.

source: Линейная регрессия: После открытия ранее настроенного пакета и запуска узла Линейная регрессия без переобучения, значения доверительных интервалов не рассчитывались и были равны 0.
en: Linear regression: After opening of earlier configured package and start of Linear regression node without retraining, confidence intervals values were not calculated and were equal to 0.

source: Линейная регрессия: при нескольких последовательных запусках переобучения на определнных наборах данных сервер зависал и его работа аварийно завершалась (#7182).
en: Linear Regression: when retraining was started several times in a row, the server was frozen with definite data sets, and its operation was crashed (#7182).

source: Логистическая регрессия: на некоторых наборах данных возникала ошибка доступа к памяти при использовании автоматической настройки и указания максимального приоритета точности.
en: Logistic regression: Memory access error occurred for the new data sets when using the automatic setting and specifying the maximum precision priority.

source: Настройка портов: сообщения об ошибках «Сокет не настроен» и «Не задана ссылка на сокет» заменены на более информативные сообщения «...: Порт ... не настроен» и «...: К обязательному порту ... не подключена связь» с указанием метки порта, в котором возникла ошибка (#6000).
en: Configure ports: "Socket is not configured" and "No reference to socket specified" error messages are replaced with the following more informative messages: "...: Port ... not configured" and "...: Link to the required port ... does not exist" specifying caption of the port in which the error occurred (#6000).

source: Нейросеть (Классификация): Исправлена ошибка «Нейросеть не обучена», возникавшая в узле Нейросеть (Классификация), конфигурация слоев которой задана с помощью управляющих переменных.
en: Neural network (Classification): "Not trained neural network" error was corrected. It occurred in the Neural network (Classification) node, the layers configuration of which was set using the control variables.

source: Нейросеть (классификация): возникала ошибка «Access violation» при обучении узла с включенной опцией «Использовать подмножество обучающего набора» для автоподбора структуры.
en: Neural network (classification): "Access violation" error occurred when training the node with the enabled "Use subset of the training set" option for structure auto selection.

source: Отчёты: иногда возникала ошибка в дереве навигации при раскрытии папки файлового хранилища или открытии файлового хранилища в соседней вкладке.
en: Reports: Sometimes an error occurred in the navigation tree when opening the file storage folder or file storage in the next tab.

source: Пакетное выполнение: Если BatchLauncher запущен с параметрами, но при этом не указан обязательный параметр Package, то пользователь получит сообщение об этом.
en: Batch processing: If BatchLauncher was started with the parameters but the obligatory Package parameter was not specified in this case, user will be informed about it in a message.

source: Пакетное выполнение: если во время пакетного выполнения пакета, удалить или переименовать файл пакета, на который ссылается выполняемый пакет, то после выполнения основного пакета в лог сервера записывалось сообщение «Ошибка доступа к файлу: ...lgp», а выполненный пакет оставался в оперативной памяти сервера, а также удаленный или переименованный пакет продолжал отображаться в списке общих пакетов в Диспетчере (#8572).
en: Batch processing: if the package file to which the processed package referred was deleted or renamed during the package batch processing, upon the main package processing, the following message was recorded to the server log: "Error accessing file: ...lgp", and the processed package remained in the server memory, whereas the deleted or renamed package was still displayed in the list of common packages in the Session Manager (#8572).

source: Панель отчетов: если свернуть в Подмодель большое количество узлов (сотни), а затем перейти на панель отчетов и открыть один из визуализаторов, настроенных на свернутый в Подмодель узел, то возникала ошибка «Значение ObjectId не закешировано» (#8124).
en: Reports bar: if you collapse many nodes (hundreds) to the Supernode and then go to the reports bar and open one of the visualizers set to the node collapsed to the Supernode, the following error occurred: "ObjectId value is not cached" (#8124).

source: Панель процессов: если выполнялось большое количество итераций в Цикле, то при попытке развернуть завершенный ранее в цикле процесс, могло выдаваться неинформативное сообщение об ошибке «Клиентский прокси-объект финализирован» (#6669).
en: Processes Bar: if many iterations were performed in the Loop, while attempting to expand the process completed earlier in the loop, the following undescriptive error message could appear: "Client proxy object disconnected" (#6669).

source: Панель процессов: при включении параметра «Отображать завершенные процессы» могли наблюдаться различные ошибки.
en: Processes Bar: when "Show completed processes" parameter was enabled, different errors could occur.

source: Параметры полей: При конвертации значений из переменного типа данных (например, в вещественный) возникала ошибка «"Строка" is an invalid float», если в конвертируемом столбце присутствовали пустые строки или строки, содержащие обычный текст.
en: Field features: When converting values from the variable data type (for example, to real), the following error occurred: "Row" is an invalid float" if there were empty rows or rows with the plain text in the converted column.

source: Параметры полей, Слияние: в мастерах настройки обработчиков Параметры полей и Слияние отключен функционал клонирования полей, который не предусмотрен в них (#9211).
en: Field features, Join: in Field features and Join handlers wizards, functionality of fields cloning that was not envisaged in them was disabled (#9211).

source: Переменные в таблицу: в режиме преобразования переменных в строки в подключенном к узлу визуализаторе Качество данных могли ошибочно определиться пропуски в колонках Имя и Метка.
en: Variables to table: in the variables to rows conversion mode in the Data quality visualizer connected to the node, null data could be incorrectly defined in Name and Caption columns.

source: Переменные: исправлено применение значений переменных пакета для случая группового редактирования переменных различных типов.
en: Variables: Application of the package variables values was corrected for the group editing of the variables related to different types.

source: Подключение ClickHouse: Исправлена ошибка, которая заключалась в нарушении порядка следования байтов GUID'а при экспорте в столбцы UUID (#10003).
en: ClickHouse connection: The following error was corrected: GUID bytes sequence order was violated when exporting UUID to columns (#10003).

source: Подключение ClickHouse: Устранили утечку памяти.
en: ClickHouse connection: The memory leak error was corrected.

source: Подключение Deductor Warehouse MS SQL: Исправлена ошибка "Cannot execute command in current transaction context until previous opened DataSet ...".
en: Connection of Deductor Warehouse MS SQL: The following error was corrected: "Cannot execute command in current transaction context until previous opened DataSet ...".

source: Подключение MySQL: Исправлена регрессионная ошибка «Access violation», которая возникала при практически одновременной (с точностью меньше миллисекунды) активация двух подключений (#10242).
en: MySQL connection: "Access violation" regression error was corrected. It occurred in the case of almost simultaneous (with accuracy less than millisecond) activation of two connections (#10242).

source: Подключение MySQL: Исправлена ошибка "Access violation", которая возникала при остановке выполнения импорта.
en: MySQL connection: "Access violation" error was corrected. It occurred when import execution process was stopped.

source: Подключение MySQL: Исправлена ошибка "Data type is not supported", которая возникала:
en: Connection of MySQL: The following error was corrected: "Data type is not supported". It occurred in the following cases:

source: Подключение ODBC: В серверных редакциях появилась возможность подключаться к SAP HANA с использованием строки подключения (#10211).
en: ODBC connection: It became possible to connect to SAP HANA using the connection string in the server editions (#10211).

source: Подключение ODBC: При использовании ODBC драйвера при импорте из базы данных поддерживаются имена таблиц и схем, содержащих символ «.» (точка).
en: ODBC connection: When using ODBC driver when importing from the database, names of the tables and schemas that contain "." (point) character are supported.

source: Подключение ODBC: при экспорте в таблицу 1, 1001, 2001, .. строк с CHARACTER SET utf8 могли возникать различные ошибки, в том числе приводящие к зависаниям или аварийному завершению приложения (#8287).
en: ODBC connection: when exporting 1, 1001, 2001, .. strings with CHARACTER SET utf8 to table, different errors could occur, including the errors that caused frozen operation or application crush (#8287).

source: Подключение Oracle: Для баз данных в кодировках UTF -8, -16, -32 появилась возможность использовать в запросах Unicode'ые строковые литералы.
en: Oracle connection: It became possible to use Unicode string literals in requests for the databases in UTF -8, -16, -32 encoding.

source: Подключение Oracle: Исправлена ошибка "Access violation", которая возникала при разрыве соединения с сервером (при отсутствии подключения к базе данных по локальной сети).
en: Oracle connection: "Access violation" error was corrected. It occurred when the connection with the server was lost (when there was no LAN connection to the database).

source: Подключение PostgreSQL: Исправлена ошибка «Error on data waiting from the connection: No such file or directory.
en: PostgreSQL connection: The following error was corrected: "Error on data waiting from the connection: No such file or directory.

source: Подключение PostgreSQL: Исправлена ошибка "Access violation", которая возникала при разрыве соединения с сервером.
en: PostgreSQL connection: "Access violation" error was corrected. It occurred when the connection with the server was lost.

source: Подключение PostgreSQL: Исправлена ошибка "column "value" is of type json but expression is of type character varying", которая возникала при попытке экспорта 1-ой строки в поля xml или json в БД PostgreSQL (#9247).
en: PostgreSQL connection: The following error was corrected: "column "value" is of type json but expression is of type character varying". It occurred when trying to export the first row to xml or json fields in PostgreSQL DB (#9247).

source: Подключение REST-сервис: Дополнили алгоритм тестирования подключения проверкой на фактическое наличие сервиса.
en: REST service connection: Algorithm of connection testing was improved due to addition of the actual service availability check.

source: Подключение SQLite: В SQLite с настройками подключения по умолчанию (режим работы LIKE "Без учета регистра") не работали запросы, содержащие LIKE и не заканчивающиеся знаком %.
en: SQLite connection: The requests that contained LIKE and did not end with % character were not operable in SQLite with the default connection settings ("Case-insensitive" LIKE operation mode).

source: Подключение SQLite: Импорт и экспорт для зашифрованной базы данных стал работать быстрее на 25%.
en: SQLite connection: Import and export for the encrypted database became 25% faster.

source: Подключение SQLite: Исправлена некорректная работа опции "Трактовать NOCASE как UNICODE".
en: SQLite connection: Incorrect operation of "Interpret NOCASE as UNICODE" option was corrected.

source: Подключение XSD-схемы: если в настройках подключения использовался относительный путь к файлу схемы, а используемая схема, в свою очередь, содержала внутри относительный путь на другую используемую схему, то возникала ошибка (#8289).
en: XSD schema connection: if a relative path to the schema file was used in the connection settings, and the used schema contained a relative path to another used schema, in its turn, an error occurred (#8289).

source: Подключение к SQLite: в версии 6.4.0 не работала настройка подключения «Создавать БД, если не существует» (#8175).
en: SQLite Connection: in version 6.4.0 "Create DB if it doesn't exist" connection setting was not operable (#8175).

source: Подключение к Базам данных: изначально настроенные параметры подключений не изменялись при последующей перенастройке.
en: Connection to Databases: initially configured connection parameters were not changed during the following reconfiguration.

source: Подключение к базам данных: восстанавливается ODBC-соединение после разрыва при подготовке и выполнении запроса при импорте из базы данных, открытие транзакции при экспорте (#8619).
en: Connection to Databases: ODBC connection was restored after break down while preparing and executing request during import from database, opening transaction during export (#8619).

source: Подключение к базе данных: Исправлена ошибка "Login failed for user...", которая возникала после открытия пакета с ранее настроенным подключением к базе данных с паролем более 32 символов, при активации или тестировании подключения.
en: Connection to database: The following error was corrected: "Login failed for user...". It occurred after opening of the package with preset connection to database with the password that contained more than 32 characters when activating or testing the connection.

source: Подключение набора XSD-схем: Исправлена ошибка "List index out of bounds", которая возникала в мастере Настройка набора XSD-схем при добавлении в список двух схем и их поочередного удаления (#9522).
en: Connection of XSD schemas set: The following error was corrected: "List index out of bounds". It occurred in Configuration of XSD schemas set wizard when adding two schemas to the list and deleting them one by one (#9522).

source: Подключение набора XSD-схем: Устранена утечка памяти, которая возникала, если подключение настроено на схему с абстрактными элементами (#10205).
en: Connection of XSD schemas set: Memory leak was eliminated. It occurred if the connection was configured for the schema with the abstract elements (#10205).

source: Подключение набора XSD-схем: Исправлена редко возникающая ошибка Access violation.
en: Connection of XSD schemas set: Rarely occurring Access violation error was corrected.

source: Подключения: при нажатии на кнопку «Тестировать» на странице Подключения, тестирование подключения выполнялось даже в том случае, если в момент тестирования выбранное подключение было активно, что могло приводить к ошибкам, например «REST-запрос: Не выбрана конечная точка сервиса WSDL для осуществления запроса».
en: Connections: when pressing on "Test" button on the Connections page, the connections were tested even if the selected connection was active at the moment of testing that could cause errors, for example, "REST request: no WSDL service endpoint selected to execute the request".

source: Подмодель: При добавлении 5 и более входных или выходных портов к подмодели и выборе типа портов после сохранения нельзя поменять тип любого из ранее добавленных портов.
en: Supernode: When adding 5 or more input or output ports to the supernode and selecting the port type, after saving it was not possible to change the type of any of the previously added ports.

source: Подмодель: после переименования входных или выходных портов существующей Подмодели разрывалась связь с портами внутренних узлов, что могло приводить к различным ошибкам (#5963).
en: Supernode: after renaming of input or output ports of the existing Supernode, connection with ports of the internal nodes was broken that could cause different errors (#5963).

source: Подмодель: Внутри вложенных узлов Выполнение и Цикл (выполняющих Подмодель, внутри которой тоже есть Выполнение/Цикл) у Узла-ссылки, находящегося внутри Подмодели была неверная ссылка на исходный узел, расположенный вне этой Подмодели.
en: Supernode: Inside the nested Execution and Loop nodes (that execute the Supernode inside which there is also Execution/Loop) for the Reference node that is inside the Supernode, there was an incorrect reference to the source node located outside this Supernode.

source: Подмодель: при активации узла, следующего за Подмоделью, внутри которой в данный момент уже активировались узлы, использующие данные входного порта подмодели, возникала ошибка «Номер строки ... вне диапазона [0; -1]» (#8705).
en: Supernode: on activation of the node following the Supernode inside which the nodes that used the supernode input port data had already been activated, the following error occurred: "Row number ... is out of [0; -1] range" (#8705).

source: Подмодель: исправлено определение базового пакета внутри вложенных производных Подмоделей.
en: Supernode: definition of the base package was corrected inside the nested derivatives of Supernodes.

source: Преобразования даты и времени: Если в мастере настройки узла последовательно выбрать несколько форматов преобразования в строку, то в предыдущей строке наблюдалась подмена шаблона на следующий выбранный.
en: Date and time transformation: If several formats of transformation to row were sequentially selected in the node wizard, the template was substituted with the next selected template in the previous row.

source: Производные компоненты: при параллельной работе сразу нескольких пакетов, по логам иногда сложно было понять в каком из них произошла ошибка при выполнении узла.
en: Derived components: When several packages were used at once in parallel, sometimes it was difficult to define by logs in which of them an error occurred during the node execution.

source: Просмотр отчетов: если пользователь с ролью «Просмотр отчетов» сразу после открытия пакета открывал отчет, содержащий визуализатор Таблица, то отчет не открывался, а пользователь получал сообщение об ошибке «При переходе на "..." возникла ошибка.
en: View reports: if a user with "View reports" role opened the report containing the Table vizualizer just after package opening, it was not possible to open the report, and this user came across the following error: "When switching to "..." error occurred".

source: Профили кластеров: в качестве разделителя десятичных знаков могли одновременно встречаться и точка <.> и запятая <,>, теперь разделитель выбирается на основании локали (#8285).
en: Cluster profiles: both point <.> and comma <,> were used as decimal separators, now the separator is selected according to locale (#8285).

source: Публикация пакета: Исправлена ошибка Access violation, которая возникала при публикации пакета или при выполнении опубликованного пакета, если у опубликованного узла не найден компонент (например, в том случае, если он был удален) (#10328).
en: Publish package: "Access violation" error was corrected. It occurred when publishing the package or when executing the published package if no component was found for the published node (for example, if it was deleted) (#10328).

source: Редактирование выбросов: при обработке строковых или логических данных, если на вход подавался пустой набор или столбцы набора состояли исключительно из пропущенных значений, то при активации узла возникала ошибка (#8114).
en: Eliminate Outliers: when processing string or logical data, if empty data set was supplied to the input, or the data set columns consisted only of null values, on activation of the node, an error occurred (#8114).

source: Сортировка: Оптимизирована сортировка набора данных по одному столбцу.
en: Sort: Sorting of data set by one column was optimised.

source: Сценарий: если закрывалась вкладка, содержащая открытую карту сценария, но при этом оставался открытым пакет, содержащий этот сценарий, то при повторном открытии сценария через панель Навигация возникала ошибка (#8384).
en: Workflow: if the tab that contained the opened workflow outline was closed, but the package that contained this workflow was still opened, an error occurred when the workflow was repeatedly opened using the Navigation bar (#8384).
